---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color)
source: html/c5107f19-6c5f-a1c3-f403-a06961290b36.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor Method

Constructs color settings object from given colors.

## Syntax (C#)
```csharp
public PointCloudColorSettings(
	Color color1,
	Color color2
)
```

## Parameters
- **color1** (`Autodesk.Revit.DB.Color`)
- **color2** (`Autodesk.Revit.DB.Color`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null